Core/src/src/Documents/НевыходыНаРаботуСотрудников/НевыходыНаРаботуСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НевыходыНаРаботуСотрудников</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.НевыходыНаРаботуСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Невыходы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возмещаемый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыхода</name>
      <type>
        <types>EnumRef.ПричиныНевыходовНаРаботу</types>
        <types>CatalogRef.ПричиныНевыходовНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыОтсутствия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Documents/НевыходыНаРаботуСотрудников/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	//УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьОтображениеКолонкиПериодОтсутствия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьОтображениеКолонкиПериодОтсутствия()

	Для каждого ТекСтрока Из Объект.Невыходы Цикл
	
		ТекСтрока.ПериодОтсутствия.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		ТекСтрока.ПериодОтсутствия.ДатаНачала = ТекСтрока.ДатаНачала;
		ТекСтрока.ПериодОтсутствия.ДатаОкончания = ТекСтрока.ДатаОкончания;
	
	КонецЦикла; 	

КонецПроцедуры // УстановитьОтображениеКолонкиПериодОтсутствия()


&НаКлиенте
Процедура НевыходыПериодОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Невыходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ТекущиеДанные.ДатаНачала = ТекущиеДанные.ПериодОтсутствия.ДатаНачала;		
		ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ПериодОтсутствия.ДатаОкончания;		
	
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтображениеКолонкиПериодОтсутствия();
КонецПроцедуры


&НаСервере
Функция  НевыходыСотрудникПриИзмененииНаСервере(Сотрудник)
	
	Запррос = Новый Запрос;
	Запррос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Период КАК Период,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК Подразделение
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних";
	
	Запррос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	ЗапрросРез = Запррос.Выполнить().Выгрузить();
	
	Если ЗапрросРез.Количество()>0 Тогда 
		Возврат ЗапрросРез[0].Подразделение;
	КонецЕсли;
	 
	 
КонецФункции

&НаКлиенте
Процедура НевыходыСотрудникПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Невыходы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Подразделение = НевыходыСотрудникПриИзмененииНаСервере(СтрокаТабличнойЧасти.Сотрудник);
	
	
	
	
КонецПроцедуры
